Revit 2027 API
BuiltInFailures.GlobalParameterFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class GlobalParameterFailures
Public NotInheritable Class GlobalParameterFailures
public ref class GlobalParameterFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GlobalParameterFailures = class end
The BuiltInFailures.GlobalParameterFailures type exposes the following members.
Properties
Name | Description
ElementPropLinkCircularChain |  Linked properties in highlighted elements cause a circular chain of references.
ElementPropLinkCircularChainError |  Linked properties in highlighted elements cause a circular chain of references.
GlobalParamFormulaCircularChain |  A formula in a global parameter causes a circular chain of references between highlighted elements.
GlobalParamFormulaCircularChainError |  A formula in a global parameter causes a circular chain of references between highlighted elements.
GlobalParamInvalidElemParamValue |  Invalid value of parameter %1!s! in highlighted element.
InvalidElementPropToGlobalParamLink |  The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.
Top
See Also
Reference
Autodesk.Revit.DB Namespace